app/controllers/books_controller.rb

  def create
    book = Book.create(book_params)
---
INSERT INTO "books" ("title", "author", "genre", "price", "published_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "hi"], ["author", "hi"], ["genre", "hi"], ["price", 0.0], ["published_date", "hi"], ["created_at", "2020-09-15 03:22:44.350823"], ["updated_at", "2020-09-15 03:22:44.350823"]]

  def update
    #@book = Book.find(params[:id])
    @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "1r"], ["updated_at", "2020-09-15 03:26:44.850552"], ["id", 11]]

  def destroy
    #@book = Book.find(params[:id])
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 12]]

  def current_book
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]